onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_АктивныеРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_АктивныеРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Рассылки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_ДоставкаНапоминанийMAX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_ДоставкаНапоминанийMAX</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попытка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АрендаДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обновлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Контакты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Enums/бит_омни_КаналыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_омни_КаналыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MAX</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Контакты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_КаналыСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/CommonModules/бит_омни_НапоминанияMAX/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Вызывается существующим заданием обмена. Только явно активированные рассылки.
// Время - время сеанса задания; часовой пояс должен совпадать с журналом записи.
Процедура ВыполнитьНапоминания(Бот) Экспорт

	Если Не ЗначениеЗаполнено(Бот) Или Не Бот.Использовать Или Бот.ПометкаУдаления
		Или Бот.Канал <> Перечисления.бит_омни_КаналыСвязи.MAX Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Настройка Из АктивныеНапоминания(Бот) Цикл
		Для Каждого Кандидат Из КандидатыНаОтправку(Бот, Настройка.Этап, ТекущаяДатаСеанса()) Цикл
			Попытка
				ОтправитьНапоминание(Бот, Настройка, Кандидат);
			Исключение
				ЗаписьЖурналаРегистрации("МАКС.Напоминания.Ошибка",
					УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Заявка,
					Кандидат.Заявка, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Чистая функция, также используется регрессионными проверками границ.
Функция ВОкнеНапоминания(ДатаНачала, Этап, Момент) Экспорт

	СекундДоПриема = ДатаНачала - Момент;
	Если Этап = "24H" Тогда
		Порог = 86400;
	ИначеЕсли Этап = "2H" Тогда
		Порог = 7200;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Порог > 0 И СекундДоПриема <= Порог И СекундДоПриема > Порог - 900;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АктивныеНапоминания(Бот)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	| Активные.Рассылка.Шаблон КАК Шаблон,
	| ВЫБОР КОГДА Активные.Рассылка.Шаблон.ИдентификаторСтандартногоШаблона = &ЗаСутки
	| ТОГДА ""24H"" ИНАЧЕ ""2H"" КОНЕЦ КАК Этап
	|ИЗ РегистрСведений.бит_омни_АктивныеРассылки КАК Активные
	|ГДЕ Активные.Бот = &Бот
	| И НЕ Активные.Рассылка.ПометкаУдаления
	| И НЕ Активные.Рассылка.Шаблон.ПометкаУдаления
	| И Активные.Рассылка.Шаблон.ИдентификаторСтандартногоШаблона В (&ЗаСутки, &ЗаДваЧаса)";
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ЗаСутки", "MAX_APPOINTMENT_REMINDER_24H");
	Запрос.УстановитьПараметр("ЗаДваЧаса", "MAX_APPOINTMENT_REMINDER_2H");
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция КандидатыНаОтправку(Бот, Этап, Момент)

	Порог = ?(Этап = "24H", 86400, 7200);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	| Заявки.Ссылка КАК Заявка, Заявки.ДатаНачала КАК ДатаНачала,
	| Контакты.Ссылка КАК Контакт
	|ИЗ Документ.Заявка КАК Заявки
	| ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_омни_Контакты КАК Контакты
	| ПО Заявки.Клиент = Контакты.Получатель
	| ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_омни_ДоставкаНапоминанийMAX КАК Доставка
	| ПО Доставка.Бот = &Бот И Доставка.Заявка = Заявки.Ссылка
	| И Доставка.ДатаНачала = Заявки.ДатаНачала И Доставка.Этап = &Этап
	|ГДЕ Заявки.ДатаНачала > &НачалоОкна И Заявки.ДатаНачала <= &КонецОкна
	| И НЕ Заявки.ПометкаУдаления
	| И Заявки.Клиент <> ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
	| И НЕ Заявки.Клиент.ПометкаУдаления
	| И Заявки.Состояние В (&Состояния)
	| И Контакты.Бот = &Бот И НЕ Контакты.ПометкаУдаления И НЕ Контакты.Заблокирован
	| И Контакты.Канал = ЗНАЧЕНИЕ(Перечисление.бит_омни_КаналыСвязи.MAX)
	| И Контакты.Идентификатор > 0
	| И (Доставка.Состояние ЕСТЬ NULL
	| ИЛИ (Доставка.Состояние = ""ВРаботе"" И Доставка.АрендаДо <= &Момент))
	|УПОРЯДОЧИТЬ ПО ДатаНачала, Заявка, Контакт";
	// В УМЦ 2.0 реквизита нет. Фрагмент фиксированный, пользовательский ввод не включается.
	Если Метаданные.Документы.Заявка.Реквизиты.Найти("Групповая") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ Заявки.ПометкаУдаления",
			"И НЕ Заявки.ПометкаУдаления И НЕ Заявки.Групповая");
	КонецЕсли;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("Этап", Этап);
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("НачалоОкна", Момент + Порог - 900);
	Запрос.УстановитьПараметр("КонецОкна", Момент + Порог);
	Запрос.УстановитьПараметр("Состояния", УправлениеЗаявками.СостоянияЗаявкиДоПриходаКлиента());
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ОтправитьНапоминание(Бот, Настройка, Кандидат)

	Если Не Бот.Использовать Или Бот.ПометкаУдаления
		Или Кандидат.Контакт.Заблокирован
		Или АктивныеНапоминания(Бот).Найти(Настройка.Шаблон, "Шаблон") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Захват фиксируется ДО HTTP. Транзакцию на время сети не удерживаем.
	ПопыткаДоставки = ЗахватитьДоставку(Бот, Кандидат, Настройка.Этап);
	Если ПустаяСтрока(ПопыткаДоставки) Тогда
		Возврат;
	КонецЕсли;
	Состояние = "Неопределено";
	ИдентификаторСообщения = "";
	ОписаниеОшибки = "MAX не подтвердил доставку идентификатором сообщения. Автоповтор отключен.";
	Попытка
		// Повторная проверка после захвата: оператор мог отменить/перенести запись.
		Заявка = Кандидат.Заявка.ПолучитьОбъект();
		Групповая = Ложь;
		Если Метаданные.Документы.Заявка.Реквизиты.Найти("Групповая") <> Неопределено Тогда
			Групповая = Заявка.Групповая;
		КонецЕсли;
		Если Заявка.ПометкаУдаления Или Групповая Или Заявка.ДатаНачала <> Кандидат.ДатаНачала
			Или Заявка.Клиент <> Кандидат.Контакт.Получатель
			Или Заявка.Клиент.ПометкаУдаления Или Кандидат.Контакт.ПометкаУдаления
			Или Кандидат.Контакт.Заблокирован
			Или Кандидат.Контакт.Бот <> Бот
			Или Кандидат.Контакт.Канал <> Перечисления.бит_омни_КаналыСвязи.MAX
			Или Не ВОкнеНапоминания(Заявка.ДатаНачала, Настройка.Этап, ТекущаяДатаСеанса())
			Или УправлениеЗаявками.СостоянияЗаявкиДоПриходаКлиента().Найти(Заявка.Состояние) = Неопределено Тогда
			Состояние = "Пропущено";
			ОписаниеОшибки = "Запись или получатель изменены перед отправкой.";
		Иначе
			Контекст = Новый Структура;
			Контекст.Вставить("appointment_id", Строка(Заявка.Ссылка.УникальныйИдентификатор()));
			Контекст.Вставить("appointment_version", Формат(Заявка.ДатаНачала, "ДФ=yyyyMMddHHmmss"));
			Контекст.Вставить("appointment_date", Формат(Заявка.ДатаНачала, "ДФ=dd.MM.yyyy"));
			Контекст.Вставить("appointment_time", Формат(Заявка.ДатаНачала, "ДФ=HH:mm"));
			Контекст.Вставить("doctor", Строка(Заявка.Сотрудник));
			Контекст.Вставить("address", Строка(Заявка.Филиал));
			Ответ = бит_омни_ИнтеграцияСMAX.ОтправитьСообщение(
				Настройка.Шаблон, Кандидат.Контакт, Бот, Контекст);
			ИдентификаторСообщения = ИдентификаторИзОтвета(Ответ);
			Если Не ПустаяСтрока(ИдентификаторСообщения) Тогда
				Состояние = "Отправлено";
				ОписаниеОшибки = "";
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Таймаут может означать уже доставленное сообщение, не отправляем вслепую снова.
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	ЗавершитьДоставку(Бот, Кандидат, Настройка.Этап, ПопыткаДоставки,
		Состояние, ИдентификаторСообщения, ОписаниеОшибки);

КонецПроцедуры

Функция ЗахватитьДоставку(Бот, Кандидат, Этап)

	ПопыткаДоставки = "";
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьДоставку(Бот, Кандидат, Этап);
		Запись = ЗаписьДоставки(Бот, Кандидат, Этап);
		Если Запись.Выбран() Тогда
			Если Запись.Состояние = "ВРаботе" И Запись.АрендаДо <= ТекущаяДатаСеанса() Тогда
				Запись.Состояние = "Неопределено";
				Запись.Обновлено = ТекущаяДатаСеанса();
				Запись.ОписаниеОшибки = "Процесс прерван: доставка неизвестна. Нужна ручная сверка истории MAX.";
				Запись.Записать();
			КонецЕсли;
		Иначе
			ПопыткаДоставки = Строка(Новый УникальныйИдентификатор);
			Запись.Состояние = "ВРаботе";
			Запись.Попытка = ПопыткаДоставки;
			Запись.Контакт = Кандидат.Контакт;
			Запись.Обновлено = ТекущаяДатаСеанса();
			Запись.АрендаДо = Запись.Обновлено + 300;
			Запись.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат ПопыткаДоставки;

КонецФункции

Процедура ЗавершитьДоставку(Бот, Кандидат, Этап, ПопыткаДоставки,
	Состояние, ИдентификаторСообщения, ОписаниеОшибки)

	НачатьТранзакцию();
	Попытка
		ЗаблокироватьДоставку(Бот, Кандидат, Этап);
		Запись = ЗаписьДоставки(Бот, Кандидат, Этап);
		Если Запись.Выбран() И Запись.Попытка = ПопыткаДоставки Тогда
			Запись.Состояние = Состояние;
			Запись.ИдентификаторСообщения = Лев(ИдентификаторСообщения, 150);
			Запись.ОписаниеОшибки = Лев(ОписаниеОшибки, 500);
			Запись.Обновлено = ТекущаяДатаСеанса();
			Запись.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Если Состояние = "Неопределено" Тогда
		ЗаписьЖурналаРегистрации("МАКС.Напоминания.ДоставкаНеопределена",
			УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.Заявка,
			Кандидат.Заявка, "Автоповтор отключен. Проверьте доставку в истории MAX.");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаблокироватьДоставку(Бот, Кандидат, Этап)

	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрСведений.бит_омни_ДоставкаНапоминанийMAX");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("Бот", Бот);
	Элемент.УстановитьЗначение("Заявка", Кандидат.Заявка);
	Элемент.УстановитьЗначение("ДатаНачала", Кандидат.ДатаНачала);
	Элемент.УстановитьЗначение("Этап", Этап);
	Блокировка.Заблокировать();

КонецПроцедуры

Функция ЗаписьДоставки(Бот, Кандидат, Этап)

	Запись = РегистрыСведений.бит_омни_ДоставкаНапоминанийMAX.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.Заявка = Кандидат.Заявка;
	Запись.ДатаНачала = Кандидат.ДатаНачала;
	Запись.Этап = Этап;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		// Прочитать очищает измерения, если запись с заданным ключом еще отсутствует.
		Запись.Бот = Бот;
		Запись.Заявка = Кандидат.Заявка;
		Запись.ДатаНачала = Кандидат.ДатаНачала;
		Запись.Этап = Этап;
	КонецЕсли;
	Возврат Запись;

КонецФункции

Функция ИдентификаторИзОтвета(Ответ)

	Успешно = Ложь;
	Отправлено = 0;
	Ошибок = 0;
	Результаты = Неопределено;
	ОтветMAX = Неопределено;
	Сообщение = Неопределено;
	Тело = Неопределено;
	Идентификатор = "";
	Если ТипЗнч(Ответ) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	// VDS возвращает пакет результатов. Напоминание отправляется одному адресату:
	// принимаем только однозначный успешный результат, не MID из ошибочного пакета.
	Если Ответ.Свойство("results") Или Ответ.Свойство("sent") Или Ответ.Свойство("failed") Или Ответ.Свойство("ok") Тогда
		Если Не Ответ.Свойство("ok", Успешно) Или Успешно <> Истина
			Или Не Ответ.Свойство("sent", Отправлено) Или Отправлено <> 1
			Или Не Ответ.Свойство("failed", Ошибок) Или Ошибок <> 0
			Или Не Ответ.Свойство("results", Результаты) Или ТипЗнч(Результаты) <> Тип("Массив") Тогда
			Возврат "";
		КонецЕсли;
		Если Результаты.Количество() <> 1 Тогда
			Возврат "";
		КонецЕсли;
		РезультатОтправки = Результаты[0];
		Если ТипЗнч(РезультатОтправки) <> Тип("Структура") Тогда
			Возврат "";
		КонецЕсли;
		Если Не РезультатОтправки.Свойство("ok", Успешно) Или Успешно <> Истина
			Или Не РезультатОтправки.Свойство("max_response", ОтветMAX)
			Или ТипЗнч(ОтветMAX) <> Тип("Структура") Тогда
			Возврат "";
		КонецЕсли;
		Ответ = ОтветMAX;
	КонецЕсли;
	// Raw MAX: {message:{body:{mid}}}, {body:{mid}} или {mid}.
	Если Ответ.Свойство("message", Сообщение) И ТипЗнч(Сообщение) = Тип("Структура") Тогда
		Ответ = Сообщение;
	КонецЕсли;
	Если Ответ.Свойство("body", Тело) И ТипЗнч(Тело) = Тип("Структура") Тогда
		Ответ = Тело;
	КонецЕсли;
	Если Ответ.Свойство("mid", Идентификатор) И ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Возврат Идентификатор;
	КонецЕсли;
	Возврат "";

КонецФункции

#КонецОбласти
